CSI API ETABS v1
cPointObj.SetDiaphragm Method
 Assigns a diaphragm to a point object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDiaphragm(
	string Name,
	eDiaphragmOption DiaphragmOption,
	string DiaphragmName = ""
)
Function SetDiaphragm (
	Name As String,
	DiaphragmOption As eDiaphragmOption,
	Optional DiaphragmName As String = ""
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim DiaphragmOption As eDiaphragmOption
Dim DiaphragmName As String
Dim returnValue As Integer
returnValue = instance.SetDiaphragm(Name,
	DiaphragmOption, DiaphragmName)
int SetDiaphragm(
	String^ Name,
	eDiaphragmOption DiaphragmOption,
	String^ DiaphragmName = L""
)
abstract SetDiaphragm :
        Name : string *
        DiaphragmOption : eDiaphragmOption *
        ?DiaphragmName : string
(* Defaults:
        let _DiaphragmName = defaultArg DiaphragmName ""
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing point object
DiaphragmOption
Type: ETABSv1.eDiaphragmOption
 This is an item from the eDiaphragmOption enumeration
 If this item is Disconnect then the point object will be disconnected from any diaphragm
 If this item is FromShellObject then the point object will inherit the diaphragm assignment of its bounding area object.
 If this item is DefinedDiaphragm then the point object will be assigned the existing diaphragm specified by DiaphragmName
DiaphragmName (Optional)
Type: System.String
 The name of an existing diaphragm
Return Value
Type: Int32
 Returns zero if the diaphragm assignment is successfully made, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DiaphragmOption As eDiaphragmOption
       Dim DiaphragmName As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'define a new diaphragm
       ret = SapModel.Diaphragm.SetDiaphragm("MyDiaph1A", True)
   'assign diaphragm to point
       ret = SapModel.PointObj.SetDiaphragm("1", eDiaphragmOption.DefinedDiaphragm, "MyDiaph1A")
   'get point diaphragm assignment
      ret = SapModel.PointObj.GetDiaphragm("1", DiaphragmOption, DiaphragmName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace